<?php
/**
 * Created by PhpStorm.
 * User: 刘立淼
 * Date: 2017-5-13
 * Time: 15:52
 */
$a=3;//控制循环的行数
for($i=1;$i<=$a;$i++){  //$b代表空格数目
    for($b=1;$b<=$a-$i;$b++){ //控制输出的空格数
        echo "&nbsp;";
    }  //$c 代表星号数目
    for($c=1;$c<=($i-1)*2+1;$c++){//控制输出的*数目
        echo "*";
    }  echo "<br/>";
} //上面的循环负责菱形的上半部分，下面的循环负责菱形的下半部分
for($i=$a-1;$i>=1;$i--){  //$b代表空格数目
    for($b=1;$b<=$a-$i;$b++){//控制输出的空格数
        echo "&nbsp;";
    }  //$c 代表星号数目
    for($c=1;$c<=($i-1)*2+1;$c++){
        echo "*";
    }  echo "<br/>";
}

//$j=0;
//for($i=5;$i>0;$i--){
//    echo "<br>";
//    for($j=$i-$j;$j>0;$j--){
//        echo "&nbsp;";
//    }
//    echo "*";
//    for($k=0;$k<2*$k+1;$k++){
//        echo "&nbsp;";
//    }
//    echo "*";
//}

?>